app/views/articles/show.html.erb

            <div class="l-right">
              <% article = CustomerArticle.where("customer_id = ? AND article_id = ?", current_user.id, a.id) %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]