app/controllers/articles_controller.rb

UPDATE "articles" SET "number_complete" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["number_complete", 2], ["updated_at", "2020-06-26 09:32:19.020813"], ["id", 3]]
---
  def update_favor
    @favor_article = CustomerArticle.find(params[:id])

    if @favor_article.is_favor == true
      @favor_article.update_attribute("is_favor", "false")
    else
      @favor_article.update_attribute("is_favor", "true")