app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("description", "tag", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "demo"], ["tag", "#java"], ["duration", "09:08:00"], ["created_at", "2020-06-26 09:08:53.311110"], ["updated_at", "2020-06-26 09:08:53.311110"]]
---
  def show
    @article_detail = Article.where(id: params[:id])
    @author = Customer.joins(:customer_articles).where("article_id = ? AND is_owner = true", @article.id)

    @course = Course.friendly.find(params[:course_slug])
    #right side - List article in course
    @list_article_right = Article.joins(:courses).where('courses.id = ?', @course.id).order(id: :asc)
    @list_article_viewed= CustomerArticle.joins(:article).where("is_viewed = true AND customer_id = ? AND article_id IN (?) ",current_user.id, @list_article_right.ids)
    @index_list_article = @list_article_right.pluck(:id).index(@article_detail.ids.first)

    @comment = Comment.new
    @comment_user = Comment.where(:article_id => @article.id).custom_display
    @comment_pin = @comment_user.where("is_pin = true").custom_display.order(updated_at: :desc).limit(1)
    cus_article = CustomerArticle.where("customer_id = ? AND article_id = ?", current_user.id, @article.id)

    if !cus_article.exists?
      CustomerArticle.create(customer_id: current_user.id, article_id: @article.id, time_point: 0.0)