app/controllers/courses_controller.rb

  def index
    @course = Course.order(number_enrollment: :desc).limit(20)
    @rate_course = Course.order(rate: :desc).limit(5)
    @free_course = Course.where(is_free: true).limit(5)
---
SELECT "courses".* FROM "courses" WHERE "courses"."is_free" = $1 LIMIT $2  [["is_free", true], ["LIMIT", 5]]

  def show

    article = Article.joins(:courses).where('courses.id = ?', @course.id)

    # @skill = Skill.joins(:article_skill).where("article_id IN (?) " , article.ids).group(:id)
    @skill = Skill.joins(:article_skills).where("article_id IN (?) " , article.ids).group(:id)

    if current_user.present?
      @check_archived_course = CustomerCourse.where('customer_id = ? AND course_id = ? AND customer_courses.enrollment_date IS null', current_user.id, @course.id)
      if !@check_archived_course.exists?
        @course_detail = Course.select("courses.*, customer_courses.*").joins(:customer_courses).where('customer_id = ? AND course_id = ?', current_user.id, @course.id)
      else
        calculate_progression
      end
      @pagy, @list_article = pagy(Article.joins(:courses).where('courses.id = ?', @course.id).order(:created_at),items: 5)

    else
      @course_detail = Course.where('course_id = ?', @course.id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 100101], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" LIMIT $1  [["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE (100104) LIMIT $1  [["LIMIT", 1]]

  def calculate_progression
    total_article = Article.joins(:course_articles).where('course_id = ?', @course.id).count
    viewed_article = Article.joins(:course_articles).joins(:customer_articles).where('course_id = ? AND is_viewed = true', @course.id).count
    #fix exception FloatDomainError
    if total_article == 0
      progress = 0
    else
      progress = viewed_article.to_f / total_article.to_f * 100
    end
    @customers_courses_progression = CustomerCourse.where(customer_id: current_user.id, course_id: @course.id).update_all(progression: progress.round) # => progression
---
UPDATE "courses" SET "name" = $1, "image" = $2, "is_free" = $3, "updated_at" = $4 WHERE "courses"."id" = $5  [["name", "java"], ["image", "nope"], ["is_free", true], ["updated_at", "2020-06-26 09:32:55.596345"], ["id", 1]]

  def search
    if params[:q].present?
      @search_result = Course.search(params[:q])
---
SELECT "courses".* FROM "courses" WHERE (100105) LIMIT $1  [["LIMIT", 1]]

  def set_course
    @course = Course.friendly.find(params[:slug])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]