app/controllers/courses_controller.rb

  def index

    #hot course
    @course = Course.order(number_enrollment: :desc).limit(20)

    @rate_course = Course.order(rate: :desc).limit(5)

    @free_course = Course.where(is_free: true).limit(5)

    @topic = Topic.all
---
SELECT "topics".* FROM "topics" LIMIT $1  [["LIMIT", 1]]

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "image", "description", "rating", "is_free", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "java"], ["image", "nope"], ["description", "nope"], ["rating", 2], ["is_free", true], ["created_at", "2020-06-26 09:26:45.197371"], ["updated_at", "2020-06-26 09:26:45.197371"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "name" = $1, "image" = $2, "is_free" = $3, "updated_at" = $4 WHERE "courses"."id" = $5  [["name", "java"], ["image", "nope"], ["is_free", true], ["updated_at", "2020-06-26 09:32:55.596345"], ["id", 1]]