app/controllers/customers_controller.rb

  def edit
 @customer =Customer.where("user_id = ?", current_user.id)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 100100], ["LIMIT", 1]]

  def update
  @customer =Customer.where("user_id = ?", current_user.id)
    name = params[:name]
    phone = params[:phone_number]
    if params[:commit] == "Cancel"
        redirect_to "/profile"
        else
        @customer.update(name: name, phone_number: phone)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 100100], ["LIMIT", 1]]
UPDATE "customers" SET "updated_at" = $1 WHERE "customers"."id" = $2  [["updated_at", "2020-07-02 07:16:40.666041"], ["id", 100100]]